I don't have a GCP account so I wasn't able to test this _fully_, but FWIW I _was_ able to get a prototype working with `apparentlymart/memory`, using this configuration:

```hcl
terraform {
  required_providers {
    google = {
      source = "hashicorp/google"
    }
    memory = {
      source = "apparentlymart/memory"
    }
    tls = {
      source = "hashicorp/tls"
    }
  }
}

variable "new_key_version" {
  type      = number
  default   = null
}

ephemeral "tls_private_key" "example" {
  count = var.new_key_version != null ? 1 : 0

  algorithm = "RSA"
  rsa_bits  = 4096
}

resource "memory" "key" {
  new_value = var.new_key_version != null ? {
    version        = var.new_key_version
    public_key_pem = ephemeral.tls_private_key.example[0].public_key_pem
  } : null
}

// I've not tested this part because I don't have a GCP account, but
// it seems consistent with how these "_wo" and "_wo_version" arguments
// behave in other resource types I've tested with before.
/*
resource "google_secret_manager_secret_version" "example" {
  # ...
  secret_data_wo         = one(ephemeral.tls_private_key.example[*].private_key_pem)
  secret_data_wo_version = memory.key.value.version
}
*/

output "key_version" {
  value = memory.key.value.version
}

output "public_key_pem" {
  value = memory.key.value.public_key_pem
}
```

The first run establishes the first "key version" and generates the initial key:

```shellsession
$ terraform apply -var=new_key_version=1
ephemeral.tls_private_key.example[0]: Opening...
ephemeral.tls_private_key.example[0]: Opening complete after 2s
ephemeral.tls_private_key.example[0]: Closing...
ephemeral.tls_private_key.example[0]: Closing complete after 0s

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # memory.key will be created
  + resource "memory" "key" {
      + new_value = (write-only attribute)
      + value     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + key_version    = (known after apply)
  + public_key_pem = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ephemeral.tls_private_key.example[0]: Opening...
ephemeral.tls_private_key.example[0]: Opening complete after 1s
memory.key: Creating...
memory.key: Creation complete after 0s
ephemeral.tls_private_key.example[0]: Closing...
ephemeral.tls_private_key.example[0]: Closing complete after 0s

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

key_version = 1
public_key_pem = <<EOT
-----BEGIN PUBLIC KEY-----
MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAnEoplXoJQRcKG5xIiLEn
bM7KPjJ4ChEmh4c9Snt6qE0h+Un4+Gw6ve1xmhZsysGccJZiB+WM9xSE80vCXMg1
jO+PbiuSqYTP2e+T4nsTTmrMlrLEKv5hPjWxSsz7dIf0ZWq7VGbKD30dTsy6Prfe
o6ndRBN+exg1y06U86Na+qRalrqpCcIsmVRgzklMhICQLpT6aJIg7241Ii+Vzwc+
i2KdWX88sWJPdtFFnoPi7Dau1ygVxFJi8a959ep9Dw7JPdidvBQ3WLUh9pQVAhnw
xnUvOUfkq4zSETPzvt1Snl/+RJMvmRXg2IMf2N5FkcTj1cqab+uoY/WmDtQ1e/ul
USNVDqEx2mhnsz30g/8SM/WCkstJQsv4IbRgyGIpExrGEv2KXnIuiyXk/iOVANWC
6K8YKbXfKaSKocWSkFmrAio/s7TTJLPq311a2ljrmacamYnf+wyVrouD1VRLYbMg
CiLwwM9Jy6n8CC4TtRshjmFpt4Y2UGMmiTHbAglf5H66yA8zLCVe4xV+RIpXIs9G
QM1tjvbpKIORCbn33dqmO2iCMtR3DmnqXpLxW1Fu7a7PT4zrZXxdk/TB1pRkL2Rc
eQ8pFsOH2jXE9chLlTk74TKRsyz9z3VIPi6kMJo4dW/BCG+Vt9Ycbr/M65ljh5gq
275aleGEp2qVtxbNAgCmUQ8CAwEAAQ==
-----END PUBLIC KEY-----

EOT
```

With one key version established, running `terraform apply` again _without_ setting that variable leaves the private key unchanged, retains the previously-recorded public key, and leaves _this_ Terraform process completely unaware of the private part of the key:

```shellsession
$ terraform apply
memory.key: Refreshing state...

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

key_version = 1
public_key_pem = <<EOT
-----BEGIN PUBLIC KEY-----
MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAnEoplXoJQRcKG5xIiLEn
bM7KPjJ4ChEmh4c9Snt6qE0h+Un4+Gw6ve1xmhZsysGccJZiB+WM9xSE80vCXMg1
jO+PbiuSqYTP2e+T4nsTTmrMlrLEKv5hPjWxSsz7dIf0ZWq7VGbKD30dTsy6Prfe
o6ndRBN+exg1y06U86Na+qRalrqpCcIsmVRgzklMhICQLpT6aJIg7241Ii+Vzwc+
i2KdWX88sWJPdtFFnoPi7Dau1ygVxFJi8a959ep9Dw7JPdidvBQ3WLUh9pQVAhnw
xnUvOUfkq4zSETPzvt1Snl/+RJMvmRXg2IMf2N5FkcTj1cqab+uoY/WmDtQ1e/ul
USNVDqEx2mhnsz30g/8SM/WCkstJQsv4IbRgyGIpExrGEv2KXnIuiyXk/iOVANWC
6K8YKbXfKaSKocWSkFmrAio/s7TTJLPq311a2ljrmacamYnf+wyVrouD1VRLYbMg
CiLwwM9Jy6n8CC4TtRshjmFpt4Y2UGMmiTHbAglf5H66yA8zLCVe4xV+RIpXIs9G
QM1tjvbpKIORCbn33dqmO2iCMtR3DmnqXpLxW1Fu7a7PT4zrZXxdk/TB1pRkL2Rc
eQ8pFsOH2jXE9chLlTk74TKRsyz9z3VIPi6kMJo4dW/BCG+Vt9Ycbr/M65ljh5gq
275aleGEp2qVtxbNAgCmUQ8CAwEAAQ==
-----END PUBLIC KEY-----

EOT
```

If at some later point that key needs to be rotated, a run with `new_key_version` set to a different value is enough to get a new key generated and the "memory" updated to refer to it:

```shellsession
$ terraform apply -var=new_key_version=2
ephemeral.tls_private_key.example[0]: Opening...
ephemeral.tls_private_key.example[0]: Opening complete after 2s
memory.key: Refreshing state...
ephemeral.tls_private_key.example[0]: Closing...
ephemeral.tls_private_key.example[0]: Closing complete after 0s

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # memory.key will be updated in-place
  ~ resource "memory" "key" {
      ~ value     = {
          - public_key_pem = <<-EOT
                -----BEGIN PUBLIC KEY-----
                MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAnEoplXoJQRcKG5xIiLEn
                bM7KPjJ4ChEmh4c9Snt6qE0h+Un4+Gw6ve1xmhZsysGccJZiB+WM9xSE80vCXMg1
                jO+PbiuSqYTP2e+T4nsTTmrMlrLEKv5hPjWxSsz7dIf0ZWq7VGbKD30dTsy6Prfe
                o6ndRBN+exg1y06U86Na+qRalrqpCcIsmVRgzklMhICQLpT6aJIg7241Ii+Vzwc+
                i2KdWX88sWJPdtFFnoPi7Dau1ygVxFJi8a959ep9Dw7JPdidvBQ3WLUh9pQVAhnw
                xnUvOUfkq4zSETPzvt1Snl/+RJMvmRXg2IMf2N5FkcTj1cqab+uoY/WmDtQ1e/ul
                USNVDqEx2mhnsz30g/8SM/WCkstJQsv4IbRgyGIpExrGEv2KXnIuiyXk/iOVANWC
                6K8YKbXfKaSKocWSkFmrAio/s7TTJLPq311a2ljrmacamYnf+wyVrouD1VRLYbMg
                CiLwwM9Jy6n8CC4TtRshjmFpt4Y2UGMmiTHbAglf5H66yA8zLCVe4xV+RIpXIs9G
                QM1tjvbpKIORCbn33dqmO2iCMtR3DmnqXpLxW1Fu7a7PT4zrZXxdk/TB1pRkL2Rc
                eQ8pFsOH2jXE9chLlTk74TKRsyz9z3VIPi6kMJo4dW/BCG+Vt9Ycbr/M65ljh5gq
                275aleGEp2qVtxbNAgCmUQ8CAwEAAQ==
                -----END PUBLIC KEY-----
            EOT
          - version        = 1
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ key_version    = 1 -> (known after apply)
  ~ public_key_pem = <<-EOT
        -----BEGIN PUBLIC KEY-----
        MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAnEoplXoJQRcKG5xIiLEn
        bM7KPjJ4ChEmh4c9Snt6qE0h+Un4+Gw6ve1xmhZsysGccJZiB+WM9xSE80vCXMg1
        jO+PbiuSqYTP2e+T4nsTTmrMlrLEKv5hPjWxSsz7dIf0ZWq7VGbKD30dTsy6Prfe
        o6ndRBN+exg1y06U86Na+qRalrqpCcIsmVRgzklMhICQLpT6aJIg7241Ii+Vzwc+
        i2KdWX88sWJPdtFFnoPi7Dau1ygVxFJi8a959ep9Dw7JPdidvBQ3WLUh9pQVAhnw
        xnUvOUfkq4zSETPzvt1Snl/+RJMvmRXg2IMf2N5FkcTj1cqab+uoY/WmDtQ1e/ul
        USNVDqEx2mhnsz30g/8SM/WCkstJQsv4IbRgyGIpExrGEv2KXnIuiyXk/iOVANWC
        6K8YKbXfKaSKocWSkFmrAio/s7TTJLPq311a2ljrmacamYnf+wyVrouD1VRLYbMg
        CiLwwM9Jy6n8CC4TtRshjmFpt4Y2UGMmiTHbAglf5H66yA8zLCVe4xV+RIpXIs9G
        QM1tjvbpKIORCbn33dqmO2iCMtR3DmnqXpLxW1Fu7a7PT4zrZXxdk/TB1pRkL2Rc
        eQ8pFsOH2jXE9chLlTk74TKRsyz9z3VIPi6kMJo4dW/BCG+Vt9Ycbr/M65ljh5gq
        275aleGEp2qVtxbNAgCmUQ8CAwEAAQ==
        -----END PUBLIC KEY-----
    EOT -> (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ephemeral.tls_private_key.example[0]: Opening...
ephemeral.tls_private_key.example[0]: Opening complete after 1s
memory.key: Modifying...
memory.key: Modifications complete after 0s
ephemeral.tls_private_key.example[0]: Closing...
ephemeral.tls_private_key.example[0]: Closing complete after 0s

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.

Outputs:

key_version = 2
public_key_pem = <<EOT
-----BEGIN PUBLIC KEY-----
MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAzYAAPV72TfRaKbZp589J
tJMldm2KqWBzkEzkpQbKuXORWt3cyjLsgTurz9EmTqtEEtAi4/1CExY4fRVvNHPQ
w/mFyWgawmB2TAOhTcp4GbDVAsUjsVOxCcv+KhtiBBdGa7ariRuSXGGzjzznCTEv
BiR9pFWM4TgzjfmoaSF3/yxuZXbEihTd1JowBs+Nd6daPZLhj3I0fgdfukDBOEaI
HrU4gYmE69ArOr3zz69azKE7cRbhd8bVExGpuRXLeUgF2U9iwrP5aoPupLISD7R1
SHOTY9XY/uh0aBU2Ze9bhsEkEklIVHOK3VlJF8rnwoHilBHVfmXoBr+FlTmy+PAp
3q6Xg9PinpQLFnmu9zL2gFRGwLrXvPXmKTJrtn7/V7Wr4oHx657Z59aA7+Q5vgMF
z7oIkP5FzodOf7bll+XVdFD7q6Ki2pw4fdlRzZMoLw6nD/1clGnpPH/+Aa60pnnm
uoe3TQ3L0lKj0WgicBdSCo/sBp03Hpv3nMrEwY/Y/BQrVfQLtu1JkAZQI7MwH3Wh
1OA9PBXH2i1YLBPncUmatc4BOdlCTXILSriDv1kg8fDDK1U2ozNzauZNLERUwmWO
LzM1HTEMGEzW6MQjlBdQlhOmoSGyXfiIGN9Om7OW0G/CnrSNMJxkZzp5DmSth8Tj
IR/BTmZ8TKNLPaLVTvAUCnECAwEAAQ==
-----END PUBLIC KEY-----

EOT
```

Since I had `google_secret_manager_secret_version.example` commented out in my example there's no mention of that in any of these plan/apply rounds, but assuming that the `_wo` and `_wo_version` arguments are treated the same way as some others I've tried in other providers I would expect that the third plan would also propose to replace `google_secret_manager_secret_version.example` in order to save the newly-generated private key.

One notable oddity is that `ephemeral.tls_private_key.example[0]` gets opened and closed during both the plan and apply phases, but it's really only the apply-time one that gets used here since during the plan phase `memory` only cares whether its `new_value` argument is null or not, and doesn't otherwise make any use of it. The final value is only committed during the apply phase, using the key generated during _that_ phase. Other than wasting a little time generating a key that nobody will use, this compromise doesn't seem to hurt anything.

Again, I'm sharing this only in case it's useful to help achieve whatever the OP was trying to achieve. I've not made any use of this utility provider in a production setting, so if someone does try to use it then I suggest testing both the rotating and non-rotating cases carefully outside of production first to make sure it behaves the way you need it to behave.
